<script type="text/javascript">

var data = [];
var x =1;
//开奖时间
var alldate = {
	"c128":[2017,10,25],
	"c129":[2017,10,26],
	"c130":[2017,10,30],
	"c131":[2017,11,1],
	"c132":[2017,11,3],
	"c133":[2017,11,6],	
	"c134":[2017,11,8],	
	"c135":[2017,11,10],	
	"c136":[2017,11,13],	
	"c137":[2017,11,15],	
	"c138":[2017,11,17],	
	"c139":[2017,11,20],	
	"c140":[2017,11,22],	
	"c141":[2017,11,24],	
	"c142":[2017,11,27],	
	"c143":[2017,11,29],	
	"c144":[2017,12,1],	
	"c145":[2017,12,4],	
	"c146":[2017,12,6],	
	"c147":[2017,12,8],	
	"c148":[2017,12,11],	
	"c149":[2017,12,13],	
	"c150":[2017,12,15],	
	"c151":[2017,12,18],	
	"c152":[2017,12,20],	
	"c153":[2017,12,22],	
	"c154":[2017,12,25],	
	"c155":[2017,12,27],	
	"c156":[2017,12,29],
};

//获取服务器时间
function getDisTime(){
	var xhr = null;
	if(window.XMLHttpRequest){
	xhr = new window.XMLHttpRequest();
	}else{
	xhr = new ActiveObject("Microsoft")
	}

	xhr.open("GET","/",false)
	xhr.send(null);
	var date = xhr.getResponseHeader("Date");
	date = new Date(date);
	if(!date)
	{
		date = 0;
	}
	let date2 = new Date();
	localStorage.distime = date2 - date;
};
getDisTime();
//获取服务器时间
function getServerDate(){
	var date = Number(new Date().getTime()) - Number(localStorage.distime);
	//date = new Date(date)
	return date;
}


//开奖数据
data[0] = {
	time: 1,
	num: [13,36,15,17,9,14,30],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","龙/木"]
}
data[1] = {
	time: 2,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[2] = {
	time: 3,
	num: [11,17,25,42,11,32,47],
	type: ["猪/土","蛇/金","鸡/金","龙/土","猪/土","虎/火","猪/金"]
}
data[3] = {
	time: 4,
	num: [43,44,22,13,21,24,41],
	type: ["兔/水","虎/水","鼠/水","鸡/水","牛/水","狗/火","蛇/土"]
}
data[4] = {
	time: 5,
	num: [48,25,40,43,30,39,34],
	type: ["狗/金","鸡/金","马/火","兔/水","龙/木","羊/火","鼠/金"]
}
data[5] = {
	time: 6,
	num: [29,32,17,30,3,37,23],
	type: ["蛇/木","虎/火","蛇/金","龙/木","羊/金","鸡/木","猪/火"]
}
data[6] = {
	time: 7,
	num: [6,16,31,37,16,40,27],
	type: ["龙/水","马/木","兔/火","鸡/木","马/木","马/火","羊/土"]
}
data[7] = {
	time: 8,
	num: [25,36,22,34,33,31,28],
	type: ["鸡/金","狗/水","鼠/水","鼠/金","牛/金","兔/火","马/土"]
}
data[8] = {
	time: 9,
	num: [1,41,14,35,29,10,25],
	type: ["鸡/火","蛇/土","猴/水","猪/水","蛇/木","鼠/火","鸡/金"]
}
data[9] = {
	time: 10,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[10] = {
	time: 11,
	num: [41,35,37,1,6,22,17],
	type: ["蛇/土","猪/水","鸡/木","鸡/火","龙/水","鼠/水","蛇/金"]
}
data[11] = {
	time: 12,
	num: [32,17,20,44,47,37,39],
	type: ["虎/火","蛇/金","虎/土","虎/水","猪/金","鸡/木","羊/火"]
}
data[12] = {
	time: 13,
	num: [3,37,47,15,34,17,48],
	type: ["羊/金","鸡/木","猪/金","羊/木","鼠/金","蛇/金","狗/金"]
}
data[13] = {
	time: 14,
	num: [28,5,1,8,15,47,30],
	type: ["马/土","蛇/水","鸡/火","虎/木","羊/木","猪/金","龙/木"]
}
data[14] = {
	time: 15,
	num: [38,45,20,31,2,30,7],
	type: ["猴/木","牛/木","虎/土","兔/火","猴/火","龙/木","兔/木"]
}
data[15] = {
	time: 16,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[16] = {
	time: 17,
	num: [11,17,25,42,11,32,47],
	type: ["猪/土","蛇/金","鸡/金","龙/土","猪/土","虎/火","猪/金"]
}
data[17] = {
	time: 18,
	num: [38,45,20,31,2,30,7],
	type: ["猴/木","牛/木","虎/土","兔/火","猴/火","龙/木","兔/木"]
}
data[18] = {
	time: 19,
	num: [3,37,47,15,14,17,48],
	type: ["羊/金","鸡/木","猪/金","羊/木","猴/水","蛇/金","狗/金"]
}
data[19] = {
	time: 20,
	num: [30,48,5,1,21,9,39],
	type: ["龙/木","狗/金","蛇/水","鸡/火","牛/水","牛/火","羊/火"]
}
data[20] = {
	time: 21,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[21] = {
	time: 22,
	num: [13,36,15,17,9,14,30],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","龙/木"]
}
data[22] = {
	time: 23,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[23] = {
	time: 24,
	num: [17,22,3,11,37,25,7],
	type: ["蛇/金","鼠/水","羊/金","猪/土","鸡/木","鸡/金","兔/木"]
}
data[24] = {
	time: 25,
	num: [3,48,5,6,21,9,19],
	type: ["羊/金","狗/金","蛇/水","龙/水","牛/水","牛/火","兔/土"]
}
data[25] = {
	time: 26,
	num: [16,32,24,40,37,27,18],
	type: ["马/木","虎/火","狗/火","马/火","鸡/木","羊/土","龙/金"]
}
data[26] = {
	time: 27,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[27] = {
	time: 28,
	num: [35,25,13,11,37,31,28],
	type: ["猪/水","鸡/金","鸡/水","猪/土","鸡/木","兔/火","马/土"]
}
data[28] = {
	time: 29,
	num: [1,41,14,35,29,10,25],
	type: ["鸡/火","蛇/土","猴/水","猪/水","蛇/木","鼠/火","鸡/金"]
}
data[29] = {
	time: 30,
	num: [13,36,15,17,9,14,30],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","龙/木"]
}
data[30] = {
	time: 31,
	num: [30,48,5,6,21,9,39],
	type: ["龙/土","狗/土","蛇/火","龙/土","牛/土","牛/土","羊/土"]
}
data[31] = {
	time: 32,
	num: [1,49,47,7,6,31,33],
	type: ["鸡/火","鸡/土","猪/金","兔/木","龙/水","兔/火","牛/金"]
}
data[32] = {
	time: 33,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[33] = {
	time: 34,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[34] = {
	time: 35,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/说","羊/火"]
}
data[35] = {
	time: 36,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[36] = {
	time: 37,
	num: [6,22,3,13,37,25,7],
	type: ["龙/水","鼠/水","羊/金","鸡/水","鸡/木","鸡/金","兔/木"]
}
data[37] = {
	time: 38,
	num: [35,25,3,11,37,30,28],
	type: ["猪/水","鸡/金","羊/金","猪/土","鸡/木","龙/木","马/土"]
}
data[38] = {
	time: 39,
	num: [2,48,5,6,21,7,19],
	type: ["猴/火","狗/金","蛇/水","龙/水","牛/水","兔/木","兔/土"]
}
data[39] = {
	time: 40,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[40] = {
	time: 41,
	num: [7,22,3,11,37,25,38],
	type: ["兔/木","鼠/水","羊/金","猪/土","鸡/木","鸡/金","鸡/木"]
}
data[41] = {
	time: 42,
	num: [5,22,13,13,17,25,22],
	type: ["蛇/水","鼠/水","鸡/水","鸡/水","蛇/金","鸡/金","鼠/水"]
}
data[42] = {
	time: 43,
	num: [13,36,15,17,9,14,30],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","龙/木"]
}
data[43] = {
	time: 44,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[44] = {
	time: 45,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[45] = {
	time: 46,
	num: [3,37,47,15,14,17,48],
	type: ["羊/金","鸡/木","猪/金","羊/木","猴/水","蛇/金","狗/金"]
}
data[46] = {
	time: 47,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[47] = {
	time: 48,
	num: [6,22,3,13,27,25,12],
	type: ["龙/水","鼠/水","羊/金","鸡/水","羊/土","鸡/金","狗/土"]
}
data[48] = {
	time: 49,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[49] = {
	time: 50,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[50] = {
	time: 51,
	num: [11,17,25,42,11,32,47],
	type: ["猪/土","蛇/金","鸡/金","龙/土","猪/土","虎/火","猪/金"]
}
data[51] = {
	time: 52,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[52] = {
	time: 53,
	num: [1,49,47,7,6,31,33],
	type: ["鸡/火","鸡/土","猪/金","兔/木","龙/水","兔/火","牛/金"]
}
data[53] = {
	time: 54,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[54] = {
	time: 55,
	num: [5,22,3,11,37,25,8],
	type: ["蛇/水","鼠/水","羊/金","猪/土","鸡/木","鸡/金","虎/木"]
}
data[55] = {
	time: 56,
	num: [1,41,14,35,29,10,9],
	type: ["鸡/火","蛇/土","猴/水","猪/水","蛇/木","鼠/火","牛/火"]
}
data[56] = {
	time: 57,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[57] = {
	time: 58,
	num: [13,36,15,17,9,14,30],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","龙/木"]
}
data[58] = {
	time: 59,
	num: [5,22,3,13,17,25,2],
	type: ["蛇/水","鼠/水","羊/金","鸡/水","蛇/金","鸡/金","鸡/火"]
}
data[59] = {
	time: 60,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[60] = {
	time: 61,
	num: [3,48,25,26,21,9,19],
	type: ["羊/金","狗/金","鸡/金","猴/金","牛/水","牛/火","兔/土"]
}
data[61] = {
	time: 62,
	num: [29,46,33,5,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","蛇/水","兔/木","鼠/水","鼠/金"]
}
data[62] = {
	time: 63,
	num: [3,36,15,17,9,16,31],
	type: ["羊/金","狗/水","羊/木","蛇/金","牛/火","马/木","兔/火"]
}
data[63] = {
	time: 64,
	num: [30,48,5,11,21,9,29],
	type: ["龙/木","狗/金","蛇/水","猪/土","牛/水","牛/火","蛇/木"]
}
data[64] = {
	time: 65,
	num: [5,22,3,11,37,31,18],
	type: ["蛇/水","鼠/水","羊/金","猪/土","鸡/木","兔/火","龙/金"]
}
data[65] = {
	time: 66,
	num: [35,25,3,11,37,30,28],
	type: ["猪/水","鸡/金","羊/金","猪/土","鸡/木","龙/木","马/土"]
}
data[66] = {
	time: 67,
	num: [30,48,5,6,21,9,12],
	type: ["龙/土","狗/土","蛇/火","龙/土","牛/土","牛/土","狗/土"]
}
data[67] = {
	time: 68,
	num: [30,8,5,6,21,9,39],
	type: ["龙/木","虎/木","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[68] = {
	time: 69,
	num: [11,17,25,42,11,32,47],
	type: ["猪/土","蛇/金","鸡/金","龙/土","猪/土","虎/火","猪/金"]
}
data[69] = {
	time: 70,
	num: [3,37,47,15,14,17,48],
	type: ["羊/金","鸡/木","猪/金","羊/木","猴/水","蛇/金","狗/金"]
}
data[70] = {
	time: 71,
	num: [13,36,15,17,9,14,30],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","龙/木"]
}
data[71] = {
	time: 72,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[72] = {
	time: 73,
	num: [30,48,5,6,21,9,39],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","羊/火"]
}
data[73] = {
	time: 74,
	num: [35,25,13,11,37,31,28],
	type: ["猪/水","鸡/金","鸡/水","猪/土","鸡/木","兔/火","马/土"]
}
data[74] = {
	time: 75,
	num: [5,22,3,11,37,31,18],
	type: ["蛇/水","鼠/水","羊/金","猪/土","鸡/木","兔/火","龙/金"]
}
data[75] = {
	time: 76,
	num: [38,4,20,31,2,30,17],
	type: ["猴/木","马/金","虎/土","兔/火","猴/火","龙/木","蛇/金"]
}
data[76] = {
	time: 77,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[77] = {
	time: 78,
	num: [30,48,5,6,21,9,29],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","蛇/木"]
}
data[78] = {
	time: 79,
	num: [1,49,47,7,6,31,33],
	type: ["鸡/火","鸡/土","猪/金","兔/木","龙/水","兔/火","牛/金"]
}
data[79] = {
	time: 80,
	num: [13,36,5,17,9,14,2],
	type: ["鸡/水","狗/水","蛇/水","蛇/金","牛/火","猴/水","猴/火"]
}
data[80] = {
	time: 81,
	num: [5,27,20,13,22,41,17],
	type: ["蛇/水","羊/土","虎/土","鸡/水","鼠/水","蛇/土","蛇/金"]
}
data[81] = {
	time: 82,
	num: [11,17,25,42,11,32,47],
	type: ["猪/土","蛇/金","鸡/金","龙/土","猪/土","虎/火","猪/金"]
}
data[82] = {
	time: 83,
	num: [5,22,13,11,37,31,28],
	type: ["蛇/水","鼠/水","鸡/水","猪/土","鸡/木","兔/火","马/土"]
}
data[83] = {
	time: 84,
	num: [35,25,3,11,37,30,28],
	type: ["猪/水","鸡/金","羊/金","猪/土","鸡/木","龙/木","马/土"]
}
data[84] = {
	time: 85,
	num: [30,48,5,6,21,9,29],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","蛇/木"]
}
data[85] = {
	time: 86,
	num: [7,36,15,17,8,16,11],
	type: ["兔/木","狗/水","羊/木","蛇/金","虎/木","马/木","猪/土"]
}
data[86] = {
	time: 87,
	num: [13,36,15,17,9,14,47],
	type: ["鸡/水","狗/水","羊/木","蛇/金","牛/火","猴/水","猪/金"]
}
data[87] = {
	time: 88,
	num: [19,36,15,34,28,16,30],
	type: ["兔/土","狗/水","羊/木","鼠/金","马/土","马/木","龙/木"]
}
data[88] = {
	time: 89,
	num: [35,22,13,11,37,31,28],
	type: ["猪/水","鼠/水","鸡/水","猪/土","鸡/木","兔/火","马/土"]
}
data[89] = {
	time: 90,
	num: [3,19,28,16,5,21,7],
	type: ["羊/金","兔/土","马/土","马/木","蛇/水","牛/水","兔/木"]
}
data[90] = {
	time: 91,
	num: [1,49,47,7,6,31,33],
	type: ["鸡/火","鸡/土","猪/金","兔/木","龙/水","兔/火","牛/金"]
}
data[91] = {
	time: 92,
	num: [24,35,20,7,29,2,3],
	type: ["狗/火","猪/水","虎/土","兔/木","蛇/木","猴/火","羊/金"]
}
data[92] = {
	time: 93,
	num: [46,14,31,27,5,9,47],
	type: ["鼠/木","猴/水","兔/火","羊/土","蛇/水","牛/火","猪/金"]
}
data[93] = {
	time: 94,
	num: [30,48,5,6,21,9,29],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","蛇/木"]
}
data[94] = {
	time: 95,
	num: [29,46,33,15,7,22,34],
	type: ["蛇/木","鼠/木","牛/金","羊/木","兔/木","鼠/水","鼠/金"]
}
data[95] = {
	time: 96,
	num: [35,25,13,11,37,31,28],
	type: ["猪/水","鸡/金","鸡/水","猪/土","鸡/木","兔/火","马/土"]
}
data[96] = {
	time: 97,
	num: [10,37,34,2,41,42,40],
	type: ["鼠/火","鸡/木","鼠/金","猴/火","蛇/土","龙/土","马/火"]
}
data[97] = {
	time: 98,
	num: [11,2,21,25,17,14,8],
	type: ["猪/土","猴/火","牛/水","鸡/金","蛇/金","猴/水","虎/木"]
}
data[98] = {
	time: 99,
	num: [30,48,5,6,21,9,29],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","蛇/木"]
}
data[99] = {
	time: 100,
	num: [20,42,16,5,36,30,2],
	type: ["虎/土","龙/土","马/木","蛇/水","狗/水","龙/木","猴/火"]
}
data[100] = {
	time: 101,
	num: [31,12,39,4,48,7,46],
	type: ["兔/火","狗/土","羊/火","马/金","狗/金","兔/木","鼠/木"]
}
data[101] = {
	time: 102,
	num: [5,22,41,45,9,2,25],
	type: ["蛇/水","鼠/水","蛇/土","牛/木","牛/火","猴/火","鸡/金"]
}
data[102] = {
	time: 103,
	num: [30,48,5,6,21,9,12],
	type: ["龙/木","狗/金","蛇/水","龙/水","牛/水","牛/火","狗/土"]
}
data[103] = {
	time: 104,
	num: [47,37,33,42,8,6,24],
	type: ["猪/金","鸡/木","牛/金","龙/土","虎/木","龙/水","狗/火"]
}
data[104] = {
	time: 105,
	num: [9,36,15,17,28,16,10],
	type: ["牛","狗","羊","蛇","马","马","鼠"]
}
data[105] = {
	time: 106,
	num: [30,26,21,28,12,19,24],
	type: ["龙","猴","牛","马","狗","兔","狗"]
}
data[106] = {
	time: 107,
	num: [11,17,25,42,11,32,47],
	type: ["猪","蛇","鸡","龙","猪","虎","猪"]
}
data[107] = {
	time: 108,
	num: [35,25,13,11,37,30,28],
	type: ["猪","鸡","鸡","猪","鸡","龙","马"]
}
data[108] = {
	time: 109,
	num: [30,48,5,6,21,9,29],
	type: ["龙","狗","蛇","龙","牛","牛","蛇"]
}
data[109] = {
	time: 110,
	num: [25,41,43,15,26,8,6],
	type: ["鸡","蛇","兔","羊","猴","虎","龙"]
}
data[110] = {
	time: 111,
	num: [30,48,5,6,21,9,39],
	type: ["龙","狗","蛇","龙","牛","牛","羊"]
}
data[111] = {
	time: 112,
	num: [18,21,40,34,35,1,31],
	type: ["龙","牛","马","鼠","猪","鸡","兔"]
}
data[112] = {
	time: 113,
	num: [15,40,13,14,22,20,32],
	type: ["羊","马","鸡","猴","鼠","虎","虎"]
}
data[113] = {
	time: 114,
	num: [16,5,33,39,37,3,9],
	type: ["马","蛇","牛","羊","鸡","羊","牛"]
}
data[114] = {
	time: 115,
	num: [11,2,21,25,17,14,18],
	type: ["猪","猴","牛","鸡","蛇","猴",""]
}
data[115] = {
	time: 116,
	num: [39,6,41,15,23,2,35],
	type: ["羊","龙","蛇","羊","猪","猴","猪"]
}
data[116] = {
	time: 117,
	num: [14,45,10,38,48,5,7],
	type: ["猴","牛","鼠","猴","狗","蛇","兔"]
}
data[117] = {
	time: 118,
	num: [35,25,3,11,37,30,22],
	type: ["猪","鸡","羊","猪","鸡","龙","鼠"]
}
data[118] = {
	time: 119,
	num: [30,48,5,6,21,9,29],
	type: ["龙","狗","蛇","龙","牛","牛","蛇"]
}
data[119] = {
	time: 120,
	num: [31,4,19,32,24,33,41],
	type: ["兔","马","兔","虎","狗","牛","蛇"]
}
data[120] = {
	time: 121,
	num: [33,9,40,30,18,16,22],
	type: ["牛","牛","马","龙","龙","马","鼠"]
}
data[121] = {
	time: 122,
	num: [20,43,24,35,31,10,16],
	type: ["虎","兔","狗","猪","兔","鼠","马"]
}
data[122] = {
	time: 123,
	num: [30,43,9,19,27,40,20],
	type: ["龙","兔","牛","兔","羊","马","虎"]
}
data[123] = {
	time: 124,
	num: [25,41,3,15,26,8,14],
	type: ["鸡","蛇","羊","羊","猴","虎","猴"]
}
data[124] = {
	time: 125,
	num: [11,2,1,5,17,14,8],
	type: ["猪","猴","鸡","蛇","蛇","猴","虎"]
}
data[125] = {
	time: 126,
	num: [30,48,5,6,21,9,1],
	type: ["龙","狗","蛇","龙","牛","牛","鸡"]
}
data[126] = {
	time: 127,
	num: [21,36,15,17,28,16,30],
	type: ["牛","狗","羊","蛇","马","马","龙"]
}
data[127] = {
	time: 128,
	num: [30,48,5,6,21,9,29],
	type: ["龙","狗","蛇","龙","牛","牛","蛇"]
}
data[128] = {
	time: 129,
	num: [35,25,3,11,37,30,28],
	type: ["猪","鸡","羊","猪","鸡","龙","马"]
}
data[129] = {
	time: 130,
	num: [3,21,36,15,17,29,8],
	type: ["羊","牛","狗","羊","蛇","蛇","虎"]
}
data[130] = {
	time: 131,
	num: [8,14,22,13,29,37,42],
	type: ["虎","猴","鼠","鸡","蛇","鸡","龙"]
}
data[131] = {
	time: 132,
	num: [25,17,8,3,14,29,1],
	type: ["鸡","蛇","虎","羊","猴","蛇","鸡"]
}
data[132] = {
	time: 133,
	num: [2,7,18,24,37,46,9],
	type: ["猴","兔","龙","狗","鸡","鼠","牛"]
}
data[133] = {
	time: 134,
	num: [5,22,12,21,35,38,39],
	type: ["蛇","鼠","狗","牛","猪","猴","羊"]
}
data[134] = {
	time: 135,
	num: [28,1,9,32,39,18,35],
	type: ["马","鸡","牛","虎","羊","龙","猪"]
}
data[135] = {
	time: 136,
	num: [35,39,29,22,26,37,7],
	type: ["猪","羊","蛇","鼠","猴","鸡","兔"]
}
data[136] = {
	time: 137,
	num: [45,41,28,9,20,10,1],
	type: ["猪","蛇","马","牛","虎","鼠","鸡"]
}


var curTimedata = alldate["c"+data[data.length-1].time];

var curTime = new Date(curTimedata[0],curTimedata[1]-1,curTimedata[2],21,0,0) ;//当前期开奖时间

var nextTimedata = alldate["c"+(data[data.length-1].time+1)];

var nextTime = new Date(nextTimedata[0],nextTimedata[1]-1,nextTimedata[2],21,0,0) ;;//下一期开奖时间

var curNum = data[data.length-1].time; //当前期的期号;
var nextNum = curNum + 1; //下一期的期号;

//跨年
if(nextTimedata[0]-curTimedata[0]>0){
	nextNum = 1;
}
var cCur = "c" + curNum;

export default
{
 data,
 alldate,
 curTimedata,
 curTime,
 nextTimedata,
 nextTime,
 curNum,
 nextNum,
 getServerDate,
}

</script>